insert into bank_customer values
('730423-1000001','김유신',1,'010-1234-1001','경남 김해시'),
('730423-1000002','김춘추',1,'010-1234-1002','경남 경주시'),
('730423-1000003','장보고',1,'010-1234-1003','경남 완도군'),
('102-12-51094','(주)정보산업',2,'010-1234-1004','부산시 부산진구'),
('930423-1000005','이순신',1,'010-1234-1005','서울 종로구');

insert into bank_account values
('101-11-1001','S1','자유저축예금','730423-1000001',1550000,'2011-04-11'),
('101-11-1002','S1','자유저축예금','930423-1000005',260000,'2011-05-12'),
('101-11-1003','S1','자유저축예금','730423-1000003',75000,'2011-06-13'),
('101-11-1004','S2','기업전용예금','102-12-51094',15000000,'2011-07-14'),
('101-11-1005','S2','정기저축예금','730423-1000002',1200000,'2011-08-15');

insert into bank_transaction (t_a_no, t_dist, t_amount, t_datetime) values
('101-11-1001',1,50000,'2023-01-01 13:15:10'),
('101-11-1001',2,1000000,'2023-01-02 13:15:12'),
('101-11-1002',3,260000,'2023-01-03 13:15:14'),
('101-11-1002',2,100000,'2023-01-04 13:15:16'),
('101-11-1003',3,75000,'2023-01-05 13:15:18'),
('101-11-1001',1,150000,'2023-01-05 13:15:28');

select c_no, c_name, a_no, a_item_name, a_balance
from bank_customer
join bank_account on a_c_no = c_no;

SELECT * FROM bank_transaction 
	WHERE t_a_no = (SELECT a_no FROM bank_account 
							WHERE a_c_no = (SELECT c_no FROM bank_customer 
														WHERE c_name = '이순신'));

SELECT * 
	FROM bank_customer AS c
    JOIN bank_account AS a ON c.c_no = a.a_c_no
    WHERE c_dist = 1
    ORDER BY a_balance DESC
    LIMIT 1;
